cmsis-svd/cmsis-svd/data/TexasInstruments/TM4C1231C3PM.svd
        <register>
          <name>DCCTL2</name>
          <description>ADC Digital Comparator Control 2</description>
          <addressOffset>0x00000E08</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL2_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL2_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL2_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL3</name>
          <description>ADC Digital Comparator Control 3</description>
          <addressOffset>0x00000E0C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL3_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL3_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL3_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL4</name>
          <description>ADC Digital Comparator Control 4</description>
          <addressOffset>0x00000E10</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL4_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL4_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL4_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL5</name>
          <description>ADC Digital Comparator Control 5</description>
          <addressOffset>0x00000E14</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL5_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL5_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL5_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL6</name>
          <description>ADC Digital Comparator Control 6</description>
          <addressOffset>0x00000E18</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL6_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL6_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL6_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCTL7</name>
          <description>ADC Digital Comparator Control 7</description>
          <addressOffset>0x00000E1C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCTL7_CIM</name>
              <description>Comparison Interrupt Mode</description>
              <bitRange>[1:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ALWAYS</name>
                  <description>Always</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_ONCE</name>
                  <description>Once</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HALWAYS</name>
                  <description>Hysteresis Always</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIM_HONCE</name>
                  <description>Hysteresis Once</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIC</name>
              <description>Comparison Interrupt Condition</description>
              <bitRange>[3:2]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_LOW</name>
                  <description>Low Band</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_MID</name>
                  <description>Mid Band</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_DCCTL7_CIC_HIGH</name>
                  <description>High Band</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_DCCTL7_CIE</name>
              <description>Comparison Interrupt Enable</description>
              <bitRange>[4:4]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP0</name>
          <description>ADC Digital Comparator Range 0</description>
          <addressOffset>0x00000E40</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP0_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP0_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP1</name>
          <description>ADC Digital Comparator Range 1</description>
          <addressOffset>0x00000E44</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP1_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP1_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP2</name>
          <description>ADC Digital Comparator Range 2</description>
          <addressOffset>0x00000E48</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP2_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP2_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP3</name>
          <description>ADC Digital Comparator Range 3</description>
          <addressOffset>0x00000E4C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP3_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP3_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP4</name>
          <description>ADC Digital Comparator Range 4</description>
          <addressOffset>0x00000E50</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP4_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP4_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP5</name>
          <description>ADC Digital Comparator Range 5</description>
          <addressOffset>0x00000E54</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP5_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP5_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP6</name>
          <description>ADC Digital Comparator Range 6</description>
          <addressOffset>0x00000E58</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP6_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP6_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>DCCMP7</name>
          <description>ADC Digital Comparator Range 7</description>
          <addressOffset>0x00000E5C</addressOffset>
          <fields>
            <field>
              <name>ADC_DCCMP7_COMP0</name>
              <description>Compare 0</description>
              <bitRange>[11:0]</bitRange>
            </field>
            <field>
              <name>ADC_DCCMP7_COMP1</name>
              <description>Compare 1</description>
              <bitRange>[27:16]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PP</name>
          <description>ADC Peripheral Properties</description>
          <addressOffset>0x00000FC0</addressOffset>
          <fields>
            <field>
              <name>ADC_PP_MSR</name>
              <description>Maximum ADC Sample Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_MSR_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PP_MSR_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_CH</name>
              <description>ADC Channel Count</description>
              <bitRange>[9:4]</bitRange>
            </field>
            <field>
              <name>ADC_PP_DC</name>
              <description>Digital Comparator Count</description>
              <bitRange>[15:10]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TYPE</name>
              <description>ADC Architecture</description>
              <bitRange>[17:16]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PP_TYPE_SAR</name>
                  <description>SAR</description>
                  <value>0x0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC_PP_RSL</name>
              <description>Resolution</description>
              <bitRange>[22:18]</bitRange>
            </field>
            <field>
              <name>ADC_PP_TS</name>
              <description>Temperature Sensor</description>
              <bitRange>[23:23]</bitRange>
            </field>
          </fields>
        </register>
        <register>
          <name>PC</name>
          <description>ADC Peripheral Configuration</description>
          <addressOffset>0x00000FC4</addressOffset>
          <fields>
            <field>
              <name>ADC_PC_SR</name>
              <description>ADC Sample Rate</description>
              <bitRange>[3:0]</bitRange>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ADC_PC_SR_125K</name>
                  <description>125 ksps</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_250K</name>
                  <description>250 ksps</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_500K</name>
                  <description>500 ksps</description>
                  <value>0x5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ADC_PC_SR_1M</name>
                  <description>1 Msps</description>
                  <value>0x7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
